0/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

flowVelocity         (20 0 0);
pressure             0;
turbulentKE          0.24;
turbulentOmega       1.78;




//++++++++++++++++++++++++++++++++++++ Coefficients for inlet velocity profile ++++++++++++++++++++++++++++++++++++++

u_star 0.85;
k_van_karman 0.42;
z_0 0.0005;
//++++++++++++++++++++++++++++++++++++ End: Coefficients for inlet velocity profile ++++++++++++++++++++++++++++++++++


//+++++++++++++++++++++++++++++++++++++ Geometry properties (blockMeshDict) +++++++++++++++++++++++++++++++++++++++++

x_0 -10;    // The intial location for geometry to avoid from the erro of "FOAM FATAL ERROR: bad set size ..." 
y_0 -10;    // The intial location for geometry to avoid from the erro of "FOAM FATAL ERROR: bad set size ..." 


x1 20;   //x1 #calc"20+$x_0";   //20;
x2 150;
x3 22;
x4 20;
x5 60;
x6 50;

h1 100;  // #calc"100+$y_0";  //100;  // elevation of the upper patch
h2 3;    // #calc"3+$y_0";   //3;
h3 25;   //#calc"25+$y_0";   //25;
h4 5;    //#calc"5+$y_0";   //5;

d 100;   //50;   // d is the depth in y direction normol to the plan

//+++++++++++++++++++++++++++++++++++++ End: Geometry properties (blockMeshDict) +++++++++++++++++++++++++++++++++++++++++


teta_wind_velocity_degree 45;    // teta_wind_velocity_factor_of_pi is a angle of velocity direction based on degree

//+++++++++++++++++++++++++++++++++++++ roughness properties (nut) +++++++++++++++++++++++++++++++++++++++++++++

/*Ks_fun_sand  0.05;
Ks_fun_Marram_grass 0.24;
Ks_fun_Marram_grass_and_sand 0.19;*/

//+++++++++++++++++++++++++++++++++++++ End: roughness properties (nut) +++++++++++++++++++++++++++++++++++++++++


// ************************************************************************* //
