0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           $internalField;
    }

    ground
    {
        type            zeroGradient;
    }

    /*motorBikeGroup
    {
        type            zeroGradient;
    }*/

    #include "include/frontBackUpperPatches"
	
	front
	{
    
	type            cyclic;
	
	//type slip;
	
	//type            zeroGradient;
	
	}

	Back
	{
    
	type            cyclic;
	
	//type slip;
	
	/*type            fixedValue;
    value           $internalField;*/
	
	}
	
}

// ************************************************************************* //
